app/controllers/issues_controller.rb

SELECT * FROM `patient`
---
  def quick_search
    name = params[:search_str].strip
    report = ""
    gender = params[:gender].strip.first rescue ""
    patients = PatientService.find_patients_by_name_and_gender(name , gender)
    @html = ""
    patients.each do | demographics |